DROP TABLE IF EXISTS stu_contact_info;

CREATE TABLE stu_contact_info
(
	id int(10) PRIMARY KEY AUTO_INCREMENT NOT NULL,
	name varchar(30) NOT NULL,
	password varchar(32) NOT NULL,
	gender char(1) NOT NULL DEFAULT 'U',
	birthday date,
	id_card_num varchar(30) NOT NULL,
	tel varchar(30) NOT NULL,
	email varchar(50),
	edu_bg varchar(30) NOT NULL,
	address varchar(100) NOT NULL,
	status char(2) NOT NULL DEFAULT 'BM',
	registTime date
);

/*
INSERT INTO stu_contact_info VALUES
(
	1,'张小军','M','河北','汉','1990-05-09','身份证','148323199005092353','13868392993','zxp@163.com','25783882'	
	,'13868392993','北京科技大学','2012-07-01','本科','计算机科学与技术','北京市朝阳区朝阳公园东路12号','张欣','姐姐','13688829382'
),(
	2,'刘晨','M','北京','汉','1989-01-13','身份证','110105198901133218','18839299382','lc113@126.com','3288229991'	
	,'18839299382','中央财经大学','2009-07-01','本科','财务管理','北京市东城区东直门内大街202号','刘勇','父亲','1399382838'
),(
	3,'凌岚','F','山东','满','1991-10-23','身份证','288238199119236328','13899283921','lingl@sohu.com','6849288382'	
	,'lingl1991','北京大学','2015-07-01','硕士','环境科学与保护','北京市海淀区蓟门北里5号楼1101房间','刘文东','丈夫','13532328829'
),(
	4,'杨梅','F','北京','汉','1985-01-19','军官证','111382999333','15538288321','yangtiger@126.com','388299938'	
	,'yang850119','国防科技大学','2012-07-01','本科','计算机科学与技术','北京市西城区德胜门内大街35号','杨树','哥哥','13688832931'
),(
	5,'李平','M','广西','壮','1998-11-20','身份证','683221199811202312','18011838223','liping_sun@gmail.com','6837232233'	
	,'18011838223','南宁市第二中学','2016-07-01','高中','无','北京市西城区地安门外大街115号','钱学良','舅舅','15332832994'
);*/
